# 公众号配置
# 公众号appId
app_id = "wxbf156391db1a7d84"
# 公众号appSecret
app_secret = "082d36161b055a085d8b164763b2adaa"
# 模板消息id
template_id = "Y8eRr3kiAZ_YvseqTcZhr9HDKBzpcLF7iJzLSLS14hQ"

# 这是openid
user = ["o1sO76K1c0RkYBbMP9-YwRFB11aw", "o1sO76BFyc0Tq1Nlp4cM02lz5KTo"]

# 信息配置
# 所在省份
province = "辽宁"
# 所在城市
city = "沈阳"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1
birthday = "2024-1-5"
# 在一起的日子，格式同上
love_date = "2023-6-7"
# 课程 从周一开始
classes = [
    [['宏观经济学', '体育', '经济学说史', '', ''],
     ['', '宏观经济学', '', '线性代数与数理统计', ''],
     ['经济学说史', '马克思基本原理', '', '', ''],
     ['大学英语A级', '创新课程', '', '', ''],
     ['大学生职业规划', '线性代数与概率统计', '马克思注意基本原理', '', ''],
     ['', '', '', '', ''],
     ['', '', '', '', '']],

    [['宏观经济学', '体育', '经济学说史', '', ''],
     ['', '宏观经济学', '', '线性代数与数理统计', ''],
     ['经济学说史', '马克思基本原理', '', '', ''],
     ['大学英语A级', '创新课程', '', '', ''],
     ['大学生职业规划', '线性代数与概率统计', '马克思注意基本原理', '', ''],
     ['', '', '', '', ''],
     ['', '', '', '', '']
     ]
]
